Австралия/src/InformationRegisters/ObjectsVersions/ObjectsVersions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ObjectsVersions</name>
  <resources>
    <name>ObjectVersion</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>VersionAuthor</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>VersionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectVersionType</name>
    <type>
      <types>EnumRef.ObjectVersionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>VersionIgnored</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Checksum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasVersionData</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VersionOwner</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Node</name>
    <comment>An internal attribute used when exporting data to a DIB.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Synchronized</name>
    <comment>An internal attribute used when exporting data to a DIB.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BeforeAfter</name>
    <comment>An internal attribute used when exporting data to a DIB.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Object</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VersionNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/ObjectsVersions/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each Record In ThisObject Do
		Record.DataSize = ObjectsVersioning.DataSize(Record.ObjectVersion);
		
		VersionData = Record.ObjectVersion.Get();
		Record.HasVersionData = VersionData <> Undefined;
		
		If IsBlankString(Record.Checksum) AND Record.HasVersionData Then
			Record.Checksum = ObjectsVersioning.Checksum(VersionData);
		EndIf;
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
